benchmarks_old/results/catzilla_complex_json.txt
Running 10s test @ http://127.0.0.1:8000/user/123/profile
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    75.25ms  173.79ms   1.97s    95.86%
    Req/Sec   551.34     98.98     1.16k    85.75%
  Latency Distribution
     50%   44.24ms
     75%   46.89ms
     90%   51.59ms
     99%    1.10s
  21975 requests in 10.01s, 9.90MB read
  Socket errors: connect 0, read 0, write 0, timeout 5
Requests/sec:   2194.35
Transfer/sec:      0.99MB