benchmarks_old/results/catzilla_json_response.txt
Running 10s test @ http://127.0.0.1:8000/json
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    11.23ms   19.35ms 355.57ms   97.14%
    Req/Sec     2.87k   675.38     6.65k    88.52%
  Latency Distribution
     50%    8.19ms
     75%    8.82ms
     90%   10.43ms
     99%  111.86ms
  77104 requests in 6.80s, 11.40MB read
  Socket errors: connect 0, read 2533, write 285, timeout 0
Requests/sec:  11333.28
Transfer/sec:      1.68MB