benchmarks_old/results/catzilla_path_params.txt
Running 10s test @ http://127.0.0.1:8000/user/42
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    73.19ms  175.47ms   1.98s    95.79%
    Req/Sec   594.20    101.11     1.13k    87.25%
  Latency Distribution
     50%   41.40ms
     75%   43.70ms
     90%   46.73ms
     99%    1.11s
  23673 requests in 10.01s, 4.42MB read
Requests/sec:   2364.55
Transfer/sec:    452.59KB