benchmarks_old/results/catzilla_query_params.txt
Running 10s test @ http://127.0.0.1:8000/users?limit=20&offset=10
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    70.25ms  145.83ms   1.96s    96.29%
    Req/Sec   523.53    102.50     1.02k    87.97%
  Latency Distribution
     50%   45.84ms
     75%   48.20ms
     90%   52.69ms
     99%  926.25ms
  20839 requests in 10.03s, 27.60MB read
  Socket errors: connect 0, read 0, write 0, timeout 12
Requests/sec:   2076.66
Transfer/sec:      2.75MB