benchmarks_old/results/catzilla_query_validation.txt
Running 10s test @ http://127.0.0.1:8000/search/validate?query=performance&limit=20&offset=0
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    80.15ms  171.04ms   1.99s    96.05%
    Req/Sec   485.90    123.15     0.99k    80.50%
  Latency Distribution
     50%   47.55ms
     75%   51.27ms
     90%   76.67ms
     99%    1.09s
  19365 requests in 10.01s, 5.58MB read
  Socket errors: connect 0, read 0, write 0, timeout 9
Requests/sec:   1933.62
Transfer/sec:    570.27KB