benchmarks_old/results/django_complex_json.txt
Running 10s test @ http://127.0.0.1:8003/user/123/profile
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.59ms    1.42ms   4.31ms   50.00%
    Req/Sec    40.00      0.00    40.00    100.00%
  Latency Distribution
     50%    3.03ms
     75%    4.31ms
     90%    4.31ms
     99%    4.31ms
  4 requests in 10.09s, 2.04KB read
  Socket errors: connect 100, read 0, write 0, timeout 0
Requests/sec:      0.40
Transfer/sec:     207.01B