benchmarks_old/results/django_hello_world.txt
Running 10s test @ http://127.0.0.1:8003/
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    84.77ms    8.78ms 146.37ms   91.58%
    Req/Sec   294.66     38.63   414.00     70.50%
  Latency Distribution
     50%   82.88ms
     75%   85.89ms
     90%   91.67ms
     99%  119.99ms
  11759 requests in 10.03s, 1.70MB read
Requests/sec:   1172.77
Transfer/sec:    174.08KB