benchmarks_old/results/django_json_response.txt
Running 10s test @ http://127.0.0.1:8003/json
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.77ms    1.55ms   5.90ms   75.00%
    Req/Sec    10.00     14.14    20.00    100.00%
  Latency Distribution
     50%    3.91ms
     75%    5.90ms
     90%    5.90ms
     99%    5.90ms
  4 requests in 10.11s, 816.00B read
  Socket errors: connect 100, read 1, write 0, timeout 0
Requests/sec:      0.40
Transfer/sec:      80.75B