benchmarks_old/results/fastapi_hello_world.txt
Running 10s test @ http://127.0.0.1:8001/
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    27.99ms    2.67ms  52.35ms   62.15%
    Req/Sec     0.90k    83.63     1.01k    62.25%
  Latency Distribution
     50%   27.66ms
     75%   30.17ms
     90%   31.42ms
     99%   33.76ms
  35699 requests in 10.01s, 5.00MB read
Requests/sec:   3566.03
Transfer/sec:    511.95KB