benchmarks_old/results/fastapi_json_response.txt
Running 10s test @ http://127.0.0.1:8001/json
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    34.07ms   13.46ms 193.49ms   96.61%
    Req/Sec   763.63    122.54     0.97k    90.20%
  Latency Distribution
     50%   31.92ms
     75%   34.73ms
     90%   36.34ms
     99%  107.39ms
  30324 requests in 10.04s, 5.26MB read
Requests/sec:   3019.95
Transfer/sec:    536.75KB