benchmarks_old/results/fastapi_query_params.txt
Running 10s test @ http://127.0.0.1:8001/users?limit=20&offset=10
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    64.42ms    5.49ms  75.89ms   65.83%
    Req/Sec   388.73     47.63   505.00     69.00%
  Latency Distribution
     50%   64.08ms
     75%   68.87ms
     90%   71.45ms
     99%   75.10ms
  15502 requests in 10.02s, 19.12MB read
Requests/sec:   1547.44
Transfer/sec:      1.91MB