benchmarks_old/results/flask_hello_world.txt
Running 10s test @ http://127.0.0.1:8002/
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    84.50ms   25.39ms 271.61ms   95.53%
    Req/Sec   302.40     54.65   390.00     86.22%
  Latency Distribution
     50%   78.74ms
     75%   83.53ms
     90%   90.69ms
     99%  252.61ms
  12057 requests in 10.10s, 1.91MB read
Requests/sec:   1193.43
Transfer/sec:    193.47KB